// Lab_01_3.cpp
// < Величко Іван >
// Лабораторна робота № 1.3
// Об’єкти – параметри методів (дії над кількома об’єктами)
// Варіант 0.4

#include <string> // підключаємо бібліотеку, яка описує літерні рядки
#include <sstream> // підключаємо бібліотеку, яка описує літерні потоки
#include <iostream>
#include "Point.h"

using namespace std;

int main()
{
	Point c, cs;
	cs.Read();       // Введення початкових координат
	cs.Display();    // Виведення початкових координат
	c = cs;
	cs.displacement(); // Введення зсуву (на скільки змістити точку)
	cs.Display();      // Виведення оновлених координат

	cout << "Distance from x to y: " << c.toString(cs) << endl; // виведення округленої відстані у буквенному форматі
	return 0;
}