#include <iostream>
#include "Array.h"
#include <Windows.h> // забезпечення відображення кирилиці

using namespace std;

int main()
{
    SetConsoleCP(1251); // забезпечення відображення кирилиці
    SetConsoleOutputCP(1251); // забезпечення відображення кирилиці

    const int N = 10;

    // Створення масивів
    Array<int, N> a(0);      // Масив, заповнений нулями
    Array<int, N> b(5);      // Масив, заповнений п’ятірками
    Array<int, N> c(b);      // Копія масиву b

    // Виведення значень масивів
    cout << "Array a: " << a << endl;
    cout << "Array b: " << b << endl;
    cout << "Array c (копія масиву b): " << c << endl;

    // Вводимо нові значення
    cout << "Введіть значення дла масиву a [" << N << "] елементів:\n" << endl;
    cin >> a;
    cout << "Оновлений масив a: " << a << endl;

    // Перевірка пошуку
    int e;
    cout << "Введіть значення елемента для пошуку: ";
    cin >> e; // Зчитуємо значення для пошуку
    int index = a.find(e); // Знаходимо індекс елемента
    if (index != -1) {
        cout << "Індекс елемента " << e << ": " << index << endl;
    }
    else {
        cout << "Елемент " << e << " не знайдений у масиві." << endl;
    }

    // Арифметичні операції
    Array<int, N> d = a + 10;   // Додаємо 10 до кожного елемента
    cout << "Масив a + 10: " << d << endl;

    d += 5;  // Додаємо 5 до кожного елемента
    cout << "Масив a + 10 + 5: " << d << endl;

    // Ітерація через масив
    cout << "Послідовний доступ до кожного елемента масиву a (ітерація через масив):" << endl;
    for (auto& x : a)
        cout << "[" << x << "] ";
    cout << endl;

    return 0;
}
